app/views/tweeets/_profile.html.erb

SELECT COUNT(*) FROM "tweeets" WHERE "tweeets"."user_id" = ?  [["user_id", 1]]
---
            <p class="heading">Tweeets</p>
            <p class="title is-6"><%= current_user.tweeets.count %></p>