app/controllers/tweeets_controller.rb

SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC
---
    def index
        @tweeets = Tweeet.all.order('created_at DESC')

INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweeet", "user generated tweeet"], ["created_at", "2020-10-19 14:16:32.854895"], ["updated_at", "2020-10-19 14:16:32.854895"], ["user_id", 1]]
---
    def create
        @tweeet = current_user.tweeets.build(tweeet_params)

        respond_to do |format|
            if @tweeet.save

DELETE FROM "tweeets" WHERE "tweeets"."id" = ?  [["id", 2]]
---
    def destroy
        @tweeet.destroy

SELECT "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_tweeet
        @tweeet = Tweeet.find(params[:id])